{
  "images": [
    {
      "filename": "1.png",
      "description": "A clean 2D mathematical plot in Euclidean space. Two distinct points labeled $x_1$ and $x_2$ are plotted. A thick, solid blue line segment connects $x_1$ and $x_2$ directly (representing $\theta \in [0,1]$). Extending outwards from this segment in both directions is a thinner, dashed grey line extending infinitely (representing the affine hull, $\theta \in \mathbb{R}$). An annotation shows the formula $x = \theta x_1 + (1-\theta)x_2$."
    },
    {
      "filename": "2.png",
      "description": "A 3D geometric visualization. A semi-transparent blue plane passes exactly through the origin $(0,0,0)$, labeled 'Subspace $V$'. Floating parallel to it is a semi-transparent red plane, labeled 'Affine Set $C$'. A solid black vector arrow labeled $x_0$ points from the origin to a point on the red plane. A dashed line connects a point $v$ on the blue plane to a point $x$ on the red plane, illustrating the translation $C = x_0 + V$."
    },
    {
      "filename": "3.png",
      "description": "Side-by-side comparison of two shapes. Left shape: A smooth, kidney-bean-shaped region labeled 'Non-Convex.' Two points inside the 'lobes' of the bean are connected by a red line segment that crosses outside the shape. Right shape: An oval or egg shape labeled 'Convex.' Two points inside are connected by a green line segment that stays entirely inside the shape."
    },
    {
      "filename": "4.png",
      "description": "A 2D scatter plot with about 15 random black dots distributed on a white background. A semi-transparent blue polygon encloses all the dots. The edges of the polygon connect the outermost dots, looking like a rubber band snapped tight around the cluster. This region is labeled 'conv(S)'."
    },
    {
      "filename": "5.png",
      "description": "A 3D mathematical visualization of the Second-Order Cone (Lorentz Cone). The shape looks like a double-ended ice cream cone originating from the origin, but we only show the top half ($t \ge ||x||_2$). The vertical axis is labeled $t$, and the horizontal plane is the $(x_1, x_2)$ plane. The surface is a smooth gradient mesh. A vector inside the cone is shown making an acute angle with the central axis."
    },
    {
      "filename": "6.png",
      "description": "A 3D coordinate system. A flat, infinite, semi-transparent plane cuts through the space (not passing through the origin), labeled 'Hyperplane $H = \{x | a^T x = b\}$'. A normal vector arrow labeled $a$ sticks perpendicularly out of the plane. The volume on one side of the plane is lightly shaded red, labeled 'Halfspace $a^T x \le b$'. The volume on the other side is lightly shaded blue, labeled 'Halfspace $a^T x \ge b$'."
    },
    {
      "filename": "7.png",
      "description": "A wireframe 3D ellipsoid floating in space. Inside the ellipsoid, three orthogonal arrows originate from the center $x_c$. These arrows represent the principal axes. They are labeled $q_1, q_2, q_3$ (eigenvectors). The lengths of these semi-axes are labeled $\sqrt{\lambda_1}, \sqrt{\lambda_2}, \sqrt{\lambda_3}$ respectively. The matrix formula $\mathcal{E} = \{x | (x-x_c)^T P^{-1} (x-x_c) \le 1\}$ is displayed below."
    },
    {
      "filename": "8.png",
      "description": "A composite 2D plot centered at the origin. Three nested shapes are drawn: 1. An inner blue diamond (square rotated 45 degrees) labeled '$L_1$ Norm' ($|x|_1 \le 1$). 2. A green circle enclosing the diamond labeled '$L_2$ Norm' ($|x|_2 \le 1$). 3. An outer red square enclosing the circle labeled '$L_\infty$ Norm' ($|x|_\infty \le 1$). The axes are labeled $x_1$ and $x_2$."
    },
    {
      "filename": "9.png",
      "description": "A 3D geometric rendering. A convex crystal-like solid (a polyhedron) is suspended in the center. Extending from each flat face of the solid are semi-transparent infinite planes (half-space boundaries) that fade out into the distance. This illustrates that the solid is the 'safe zone' intersection of all these linear inequalities ($Ax \le b$)."
    },
    {
      "filename": "10.png",
      "description": "A visualization of the set of $2 \times 2$ positive semidefinite matrices in 3D space. The axes represent the three unique entries of a symmetric matrix: $x, y, z$ for $\\begin{bmatrix} x & y \\\\ y & z \\end{bmatrix}$. The shape is a convex cone with a circular cross-section, rotated 45 degrees relative to the axes. The interior is shaded to represent positive semidefiniteness ($xz - y^2 \ge 0, x \ge 0, z \ge 0$)."
    },
    {
      "filename": "11.png",
      "description": "A Venn-diagram style geometry illustration. Two distinct convex shapes (e.g., a blue ellipse and a yellow triangle) overlap partially. The overlapping region is highlighted in green. Text indicates that while the union (blue + yellow) is non-convex, the intersection (green) is strictly convex."
    },
    {
      "filename": "12.png",
      "description": "A 2D plot illustrating the set $S$ from Section 10. The shape is a convex region in the center, defined by an infinite number of straight lines tangent to it. These lines create a smooth, curved boundary for the central convex shape, visually demonstrating that the intersection of infinitely many linear constraints results in a smooth convex set."
    },
    {
      "filename": "13.png",
      "description": "A 2D visualization of the set $S$ (trigonometric polynomials). In the center is a smooth, convex, kidney-bean-shaped white region. Surrounding it is a hundreds of straight lines. Each line is tangent to the curve or passes close to it, representing the boundaries of the halfspaces $c(t)^T x \le 1$. The region $S$ is the 'safe zone' in the middle where all these halfspaces overlap. The lines densify to form the smooth boundary of the set."
    },
    {
      "filename": "14.png",
      "description": "A 3D plot of a convex indicator function $\delta_C(x)$ approximated for visualization. A flat 2D plane represents $\mathbb{R}^2$. On this plane is a convex shape (e.g., a hexagon) colored blue. Inside the hexagon, the function height is exactly 0. Outside the hexagon, the 'walls' of the function shoot vertically upwards to infinity (represented by fading vertical cliffs). A semi-transparent plane cuts through at height $z=1$, showing that the sublevel set is exactly the hexagon."
    },
    {
      "filename": "15.png",
      "description": "A 2D plot showing a complex non-convex shape, like a crescent moon or a star. The shape is filled in dark grey. Surrounding it is a lighter, semi-transparent blue shape that represents the convex hull. The hull 'bridges the gaps' between the tips of the crescent/star with straight lines, creating the smallest convex polygon that contains the original shape. Points inside the gap are highlighted as being 'in the hull but not in the set.'"
    },
    {
      "filename": "16.png",
      "description": "A 2D diagram. A large cloud of 50 black points is scattered. Their convex hull is drawn as a polygon. A specific point $x$ deep inside the hull is highlighted in red. A triangle (3 points, $n+1$ for $\mathbb{R}^2$) formed by three of the original black points encloses the red point. This illustrates that any point in the hull can be described by just 3 vertices, even if the hull is made of 50 points."
    },
    {
      "filename": "17.png",
      "description": "A 3D to 2D geometric transformation. In 3D space, a complex, multi-faceted convex polyhedron (like a dodecahedron) floats. A light source 'projects' its shadow onto a 2D floor plane. The shadow is a convex 2D polygon. Lines connect the vertices of the 3D shape to the vertices of the 2D shadow, illustrating $f(x) = Ax$ acting as a projection that preserves convexity."
    },
    {
      "filename": "18.png",
      "description": "A 3D visualization. A double-napped cone (hourglass shape) is semi-transparent. A flat 2D plane cuts through the top half of the cone at an angle. The intersection of the plane and the cone creates an ellipse drawn in bright red on the plane. This illustrates the preimage of the cone under the affine map defined by the plane's equation is a convex set (the ellipse)."
    },
    {
      "filename": "19.png",
      "description": "A 2D plot comparing a set and its image under a non-affine map. Left: A convex square in the $(x,y)$ plane. Right: The image of that square under the map $f(x,y) = x/y$ plotted on a number line. The image might be a disjoint set or a non-convex interval depending on the square's position (e.g., crossing $y=0$), visually demonstrating that non-affine maps can break convexity."
    },
    {
      "filename": "20.png",
      "description": "A 3D visualization of the Hyperbolic Cone. It looks like a stack of ellipses. At the bottom ($c^T x = 0$), it is a point. As you move up along the vector $c$, the cross-sections are ellipses that grow larger. The 'walls' of the cone are smooth but flattened (not circular like the SOC), illustrating the matrix $P$ determining the shape of the cross-sectional ellipses."
    },
    {
      "filename": "21.png",
      "description": "A 3D rendering of a Spectrahedron (the feasible set of an LMI). It looks like a 'puffy' cube or a rounded tetrahedron. The edges are not sharp lines but smooth curves, and the faces bulge slightly. This shape represents the intersection of the cone of positive semidefinite matrices with an affine subspace. It highlights the difference between linear programming (flat facets) and semidefinite programming (curved, smooth boundaries)."
    },
    {
      "filename": "22.png",
      "description": "A split-screen comparison. Left (Image): A unit circle (Ball) is transformed by a matrix $A$ into a stretched Ellipsoid. Right (Preimage): A 'slab' or 'strip' between two parallel lines is shown. This represents the preimage $\{x \mid |a^T x| \le 1\}$ for a rank-deficient matrix (a single row vector), illustrating that the preimage of a ball can be an unbounded convex set (a degenerate ellipsoid)."
    },
    {
      "filename": "23.png",
      "description": "A 3D geometric setup. The origin $(0,0,0)$ is marked as the 'Center of Projection.' A flat, semi-transparent plane is positioned at height $t=1$ (parallel to the $x$-axes). A 3D convex object (e.g., a floating blue ellipsoid) is positioned at a height $t > 1$. Rays of light (dashed yellow lines) originate from $(0,0,0)$, pass through the ellipsoid, and hit the $t=1$ plane. The intersection of these rays with the plane forms a smaller, convex shadow (the image $P(S)$). This illustrates $P(x,t) = x/t$ as a projection onto the unit plane."
    },
    {
      "filename": "24.png",
      "description": "A visualization of $\mathbb{R}^{n+1}$. A horizontal plane at $t=0$ divides the space. The area below the plane ($t \le 0$) is shaded in dark grey and labeled 'Undefined / Invalid Domain.' The area above ($t > 0$) is clear. A vector trajectory starts in the clear zone and approaches $t=0$; as it gets closer, its mapped projection on a reference plane shoots off toward infinity, visualizing the singularity at $t=0$."
    },
    {
      "filename": "25.png",
      "description": "A side-by-side comparison of a 2D grid transformation using $f(x) = x / (x_1 + x_2 + 1)$. Left (Input): A regular, square grid in the region where $x_1 + x_2 + 1 > 0$. The line $x_1 + x_2 + 1 = 0$ is drawn as a dashed red 'Horizon Line.' Right (Output): The transformed grid. The squares close to the origin are relatively normal. The squares that were close to the red line in the input are now stretched immensely, fanning out towards infinity. Despite the extreme warping, the grid lines remain straight or become conic sections, and the convex squares remain convex regions."
    },
    {
      "filename": "26.png",
      "description": "A conceptual flow diagram. 1. Input: A convex set $S$ (a blob). 2. Step 1 (Affine $g(x)$): The blob is rotated and translated in 3D space (lifted to $c^T x + d$). 3. Step 2 (Perspective $P$): The 3D blob is projected back down onto a 2D plane from the origin. 4. Result: The final 2D shape $f(S)$. This illustrates the decomposition $f = P \circ g$."
    },
    {
      "filename": "27.png",
      "description": "A triptych (three distinct 3D models) comparing cone properties. Left (Proper): A standard 'Ice Cream Cone' (Second-Order Cone). Labels point out it is Pointed (sharp tip), Solid (has volume), and Closed (includes skin). Center (Not Pointed): A 'Wedge' or 'Open Book' shape extending infinitely. It contains a full line running along its spine. The line is highlighted red to show why it fails the pointedness test. Right (Not Solid): A flat, 2D pie-slice sector floating in 3D space. It has no volume (interior is empty in $\mathbb{R}^3$), showing why it fails the solid test."
    },
    {
      "filename": "28.png",
      "description": "A visualization of the cone $K$ of nonnegative polynomials of degree 3. The axes represent coefficients $x_1, x_2, x_3$. A point in the space is a vector. Attached to a specific point $x$ is a small callout bubble showing the graph of the corresponding polynomial $p_x(t)$ on $[0,1]$ perfectly touching the x-axis but never crossing it. The boundary of this cone represents polynomials with real roots in $[0,1]$."
    },
    {
      "filename": "29.png",
      "description": "A 2D plane with a proper cone $K$ (an angle less than 180 degrees) rooted at the origin. A point $y$ is marked. Attached to $y$ is an inverted cone $-K$ (the cone $K$ rotated 180 degrees and shifted to $y$). The region covered by this inverted cone is shaded green. Any point $x$ inside this green region satisfies $y - x \in K$, and thus $x \preceq_K y$. This visualizes the 'Cone of inferior points.'"
    },
    {
      "filename": "30.png",
      "description": "A 3D abstract representation of $S^2_+$ (the cone of $2 \times 2$ PSD matrices). Two points (matrices) $A$ and $B$ are plotted inside the cone. $B$ is 'higher' up the cone axis than $A$. A smaller cone is rooted at $A$. If $B$ lies inside the cone originating at $A$, then $A \preceq B$. This illustrates that the order is partial—some matrices are neither 'bigger' nor 'smaller' than others (they don't fall in each other's relative cones)."
    },
    {
      "filename": "31.png",
      "description": "A 2D plot illustrating the partial order $\preceq_{\mathbb{R}^2_+}$. Left (Minimum): A convex polygon $S_1$ whose bottom-left vertex physically touches the point $(1,1)$. The region 'dominated' by $(1,1)$ (i.e., $\{x \mid x \succeq (1,1)\}$) is shaded light grey, and the entire polygon lies inside this region. The point $(1,1)$ is labeled 'Minimum Element.' Right (Minimal): A different convex polygon $S_2$ floating in the positive quadrant, not 'pointed' at any single bottom-left direction. The entire lower-left boundary (a chain of edges) is highlighted in thick red. These are the 'Minimal Elements' (Pareto frontier). Arrows pointing down and left from these points enter empty space, showing no point in the set is smaller."
    },
    {
      "filename": "32.png",
      "description": "A visualization in $\mathbb{R}^2$. A proper cone $K$ is drawn in blue (e.g., spanning angles $30^\circ$ to $60^\circ$). The dual cone $K^*$ is drawn in red. The relationship is geometric: The boundaries of $K^*$ are perpendicular to the boundaries of $K$. A vector $x \in K$ and a vector $y \in K^*$ are shown with an angle between them $\le 90^\circ$ (acute angle), illustrating $\langle x, y \rangle \ge 0$. A vector $z \notin K^*$ makes an obtuse angle ($>90^\circ$) with some vector in $K$, visualizing why it fails the dual condition."
    },
    {
      "filename": "33.png",
      "description": "A composite image showing the three main self-dual cones. Top-Left: The nonnegative orthant $\mathbb{R}^3_+$. A cube corner. Top-Right: The Second-Order Cone (Ice Cream Cone). Bottom: The PSD cone $S^2_+$ represented as a 3D convex cone. Text labels indicate $K = K^*$ for all three, emphasizing their special geometric symmetry."
    },
    {
      "filename": "34.png",
      "description": "A visualization of the dual relationship between norm cones. Left: The $L_1$ norm cone in 3D ($|x|_1 \le t$). It looks like an inverted square pyramid. Right: The $L_\infty$ norm cone in 3D ($|x|_\infty \le t$). It looks like an inverted pyramid with a square base rotated 45 degrees relative to the $L_1$ cone. Captions connect them: 'Primal: 1-norm cone' $\leftrightarrow$ 'Dual: $\infty$-norm cone'."
    },
    {
      "filename": "35.png",
      "description": "A clean 2D geometry plot. Two disjoint, closed convex sets $C$ (a blue kidney bean) and $D$ (a green square) are separated by a noticeable gap. A dashed line (the separating hyperplane) runs through the gap without touching either set. Two arrows represent the closest points $x^* \in C$ and $y^* \in D$. The normal vector $a = y^* - x^*$ is drawn perpendicular to the separating line. The inequalities $a^T x < b$ and $a^T y > b$ are annotated on their respective sides."
    },
    {
      "filename": "36.png",
      "description": "A 3D visualization. A smooth, convex body (like a potato) floats in space. A point $x_0$ is marked on its surface boundary. A flat, semi-transparent plane touches the body exactly at $x_0$ (tangent plane). A normal vector $a$ points outwards from the plane. The entire body lies on one side of the plane, illustrating the definition $a^T x \le a^T x_0$. A 'ghost' point $y$ outside the set is shown projecting onto $x_0$, hinting at the proof mechanism."
    },
    {
      "filename": "37.png",
      "description": "A counter-example illustration. Two disjoint sets are shown. One is C-shaped (non-convex) and 'hugs' the other set (a circle). There is no straight line that can separate them without cutting through the C-shape. This highlights why convexity is a crucial condition for the Separating Hyperplane Theorem."
    }
  ]
}
