[
  {
    "filename": "convex_composition_case1.png",
    "description": "A step-by-step graphical composition. Panel 1 (Inner): Graph of a convex function g(x) = x^2. Two points x_1, x_2 and their chord are shown, illustrating the convexity inequality g(avg) <= avg(g). Panel 2 (Outer): Graph of a convex, increasing function h(u) = e^u. The output range of g maps to the input domain of h. Panel 3 (Composite): Graph of f(x) = e^{x^2}. The convexity is preserved and amplified. The visual logic shows how the 'smile' of g is stretched upwards by h, making the resulting curve even more convex."
  },
  {
    "filename": "convex_composition_case2.png",
    "description": "A similar 3-panel composition. Panel 1: Graph of a concave function g(x) = sqrt(x). The chord lies below the curve. Panel 2: Graph of a convex, decreasing function h(u) = 1/u. Panel 3: Graph of f(x) = 1/sqrt(x). The 'frown' of g is flipped by the decreasing nature of h into a 'smile', and the convexity of h reinforces it, resulting in a convex composite function."
  },
  {
    "filename": "quasiconvex_sublevel.png",
    "description": "A 3D surface plot of a function that is quasiconvex but not convex (e.g., a 'volcano' shape with a monotonic crater, or a bell curve inverted). Horizontal planes cut through the surface at various heights alpha. The resulting cross-sections (sublevel sets S_alpha) are projected onto the xy-plane. All these projected sets are convex shapes (circles, ellipses), satisfying the definition. A chord connecting two points on the surface is shown passing *above* the function surface in the middle (violating convexity), but the 'no overshoot' condition holds relative to the max endpoint."
  },
  {
    "filename": "quasiconvex_gradient.png",
    "description": "A contour plot of a quasiconvex function. A point x is marked on a contour line f(x) = c. The gradient vector nabla f(x) is drawn perpendicular to the contour, pointing towards higher values (outwards). A region of 'lower or equal values' (f(y) <= f(x)) is shaded. Several vectors y-x are drawn from x into this shaded region. The angle between nabla f(x) and any vector y-x is shown to be >= 90 degrees (obtuse), visually confirming nabla f(x)^T(y-x) <= 0."
  },
  {
    "filename": "log_concave_gaussian.png",
    "description": "A visual comparison. Top: A standard Gaussian bell curve f(x). It has an inflection point and is bell-shaped (not concave). Bottom: The graph of log f(x). This transforms the bell curve into a perfect, downward-opening parabola (concave quadratic). This visually proves that the Gaussian is log-concave."
  }
]
